Revit 2024 API
BuiltInFailures.SplineFailures.CannotCreateSpline Property
 Can't make Spline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateSpline { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateSpline As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateSpline {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SplineFailures Class
Autodesk.Revit.DB Namespace